.config/doom/config.org
* GPTEl
Registering Backend Models and AIs, making default Backend:

#+BEGIN_SRC emacs-lisp :tangle yes
(gptel-make-openai "xAI"
  :host "api.x.ai"
  :key (shell-command-to-string (format "gopass show sub/private_key/xai"))
  :endpoint "/v1/chat/completions"
  :stream t
  :models '(grok-2-latest))

;; OPTIONAL configuration
(setq
 gptel-model   'grok-2-latest
 gptel-backend
 (gptel-make-openai "xAI"           ;Any name you want
   :host "api.x.ai"
   :key (shell-command-to-string (format "gopass show sub/private_key/xai"))              ;can be a function that returns the key
   :endpoint "/v1/chat/completions"
   :stream t
   :models '(;; xAI now only offers `grok-beta` as of the time of this writing
             grok-2-latest)))
#+END_SRC

** DIRECTIVEs
#+begin_src emacs-lisp :tangle yes
(setq! gptel-directives '(
 (default . "Test 32")
 (studying .
"I am working in Doom Emacs using Org Mode to document research in a `.org` file. My goal is to improve the quality of the file, making it more readable, accessible, and well-structured for learning and reference. Depending on my request, you will provide one of the following types of support:

1. **Rewriting the Whole File**:
   - If I ask to rewrite the entire `.org` file, provide **only the new structured `.org` file** as the output, without any explanations, documentation, or unrelated content. Follow these guidelines:
     - Use clear and consistent title structures (all titles must be in UPPER CASE; plural words like CATs should have a lowercase 's').
     - Apply Org Mode best practices for documenting research, such as logical hierarchy, tags, and metadata.
     - Do not modify the existing configuration data (e.g., `:PROPERTIES:`, `#+title:`, `#+filetags:`, etc.).
     - Organize content with sections, subsections, and bullet points.
     - Include `.org` code blocks to demonstrate improvements and practical exercises (if applicable).

2. **Support for Small Pieces of Research**:
   - If I ask for help with a small piece of research or a specific point, focus on providing clear, concise, and well-structured support. Follow these strategies:
     - Use human-readable and learning-friendly formats.
     - Explain complex terms or concepts if necessary.
     - Provide examples, references, or documentation if requested.
     - Structure the response to make it easy to integrate into the `.org` file.

3. **Improving Text Structure**:
   - If I ask for help structuring text to make it more readable, focus on organizing the content logically. Use headings, bullet points, and clear formatting to enhance readability.

4. **Providing Examples or References**:
   - If I ask for examples, provide `.org` code blocks or practical demonstrations.
   - If I ask for references or documentation, suggest reliable sources or links to further information.

5. **Translation into Other Languages**:
  - If I ask for translation support, provide an accurate and context-aware translation of the specified content into the requested language. Ensure the translation maintains the original meaning, tone, and structure while adapting to the target language's conventions.

**General Guidelines**:
- Always prioritize clarity, readability, and usability.
- Adapt your response to the specific type of support I request.
- Do not include unnecessary explanations, documentation, or unrelated content unless explicitly requested.

**Deliverables**:
 - Provide only the requested output, whether it’s a rewritten .org file, support for a small piece of research, improved text structure, examples, references, or translations. Do not include additional explanations or unrelated content unless explicitly requested.
 ")
 (documentation .
  "
You are an expert developer specialized in refining code documentation. Your sole focus is improving the clarity and readability of the documentation without altering the code or structure. Follow these guidelines strictly:
Description

    Clearly and concisely explain the purpose of the function, class, or module.
    Cross-check the description with the code to ensure accuracy. The explanation must fully align with what the code does.
    Avoid jargon or buzzwords like scalable, intuitive, or robust.
    Provide enough context for someone new to coding to understand, but donÔÇÖt oversimplify.

Usage

    If a usage example exists, ensure it reflects the most common and simplest use case for the code.
    Verify that the usage aligns with the codeÔÇÖs behavior. Refine it to be precise, accurate, and functional out of the box.
    Be precise. No room for vagueness.

Parameters/Attributes

    If parameters or attributes are documented, verify they match the code exactly. Ensure names, types, and purposes are accurate and specific.
    Describe each parameter/attribute in a short, one-line summary that eliminates ambiguity.
    Do not add parameter documentation if itÔÇÖs not already present in the code.

Important Notes:

    Do not modify the code itself.
    Do not add new sections or alter the documentation structure.
    Always verify the documentation matches the code, ensuring accuracy and relevance.
    Keep explanations terse, professional, and focused. Skip pleasantries or unnecessary details.
    Always return just the answer and only the answer. Do not enclose it in code blocks, as we are already in a code editor.
")
 ))

#+end_src

* TRAMP WINDOWS
PuTTY Installation and plink ENV/Variable for Host Connections.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq password-cache-expiry nil)
#+END_SRC

#+begin_src emacs-lisp :tangle yes
;;; package --- Inserting a new Tramp Method
;;; Commentary:
;;; Adding a new Tramp Method to execute docker containers.
;;;
;;; Code:
(require 'tramp)
(add-to-list 'tramp-methods `("plinkw"
               (tramp-login-program "plink")
               (tramp-login-args (("-ssh")
				  (,(format
				     "dockware@127.0.0.1 -pw dockware"))))
               (tramp-remote-shell "/bin/sh")))
#+end_src

#+BEGIN_SRC emacs-lisp :tangle no
(setq password-cache-expiry nil)

(when (eq window-system 'w32)
  (setq tramp-default-method "plink")
  (when (and (not (string-match putty-directory (getenv "PATH")))
	     (file-directory-p putty-directory))
    (setenv "PATH" (concat putty-directory ";" (getenv "PATH")))
    (add-to-list 'exec-path putty-directory)))
#+END_SRC

* OPEN DIRECTORY
Custom script to open directories

#+begin_src emacs-lisp :tangle yes
(defun open-directory (dir)
  "Open the specified directory DIR in Dired mode."
  (interactive "DChoose directory: ") ; Prompt for directory
  (dired dir))
#+end_src

** WORK
#+begin_src emacs-lisp :tangle yes
(defun shoptron ()
  "Open the Shoptron main Directory"
  (interactive)
  (open-directory "/plinkw:dockware@127.0.0.1:~/html"))

(defun shtheme ()
  "Open the ShoptronTheme main Directory"
  (interactive)
  (open-directory "/plinkw:dockware@127.0.0.1:~/html/custom/plugins/ShoptronTheme"))

(defun shconfigurator ()
  "Open the ShoptronConfiurator main Directory"
  (interactive)
  (open-directory "/plinkw:dockware@127.0.0.1:~/html/custom/plugins/ShoptronConfigurator"))
#+end_src

* SERVER SOCKET - SERVER FILE
#+begin_src emacs-lisp :tangle yes
(require 'server)
(setq server-use-tcp t
      server-socket-dir "~/.config/emacs/server")
;; (unless (server-running-p)
;;     (server-start))
#+end_src

* TREE-SITTER
#+begin_src emacs-lisp :tangle yes
;;; Tree Sitter

(use-package! tree-sitter
   :hook (prog-mode . turn-on-tree-sitter-mode)
   :hook (tree-sitter-after-on . tree-sitter-hl-mode)
   :config
   (require 'tree-sitter-langs)
   ;; This makes every node a link to a section of code
   (setq tree-sitter-debug-jump-buttons t
         ;; and this highlights the entire sub tree in your code
         tree-sitter-debug-highlight-jump-region t))
#+end_src

** INSTALLING PACKAGEs
#+begin_src emacs-lisp :tangle yes
(use-package treesit
  :config
  (setq treesit-font-lock-level 4)
  (setq treesit-extra-load-path '("~/.config/emacs/tree-sitter"))
  (setq treesit-language-source-alist
        '((css "https://github.com/tree-sitter/tree-sitter-css" "v0.20.0")
          (json "https://github.com/tree-sitter/tree-sitter-json" "v0.20.2")
          (markdown "https://github.com/ikatyang/tree-sitter-markdown" "v0.7.1")
          (html "https://github.com/tree-sitter/tree-sitter-html" "v0.20.1")
          (php "https://github.com/tree-sitter/tree-sitter-php" "master" "php/src")
          (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "v0.20.1")))
  (setq major-mode-remap-alist
        '((css-mode . css-ts-mode)
          (html-mode . html-ts-mode)
          (markdown-mode . markdown-ts-mode)
          (json-mode . json-ts-mode)
          (php-mode . php-ts-mode)
          (js2-mode . js-ts-mode))))


(use-package combobulate
   :custom
   ;; You can customize Combobulate's key prefix here.
   ;; Note that you may have to restart Emacs for this to take effect!
   (combobulate-key-prefix "C-c o")
   :hook ((prog-mode . combobulate-mode))
   ;; Amend this to the directory where you keep Combobulate's source
   ;; code.
   :load-path ("~/.config/doom/custom_packages/combobulate"))

;; (require 'treesit)

;; (add-to-list 'treesit-language-source-alist
;;              '(php "~/.config/emacs/tree-sitter/tree-sitter-php"))

;; (add-to-list 'major-mode-remap-alist
;;              '(php-mode . php-ts-mode))
#+end_src

* WEB-MODE
#+begin_src emacs-lisp :tangle yes
(use-package web-mode
  :config
  (add-to-list 'auto-mode-alist '("\\.html\\.twig\\'" . web-mode))
  (setq web-mode-enable-current-element-highlight t)
  (setq web-mode-enable-current-column-highlight t)
  (setq web-mode-block-padding 2))
#+end_src

* SHELL FOR COMPILATION
#+begin_src emacs-lisp :tangle yes
(use-package compile
  :config
  (setq! shell-file-name "C:/Users/MORENOC0/scoop/apps/pwsh/7.5.0/pwsh.exe"))
#+end_src
